using Tyuiu.TatarinovDA.Sprint2.Task5.V15.Lib;
//Написать программу, которая использует оператор switch вычисляет требуемое значение и возвращает результат.
//Условие: Дано целое число k(1 <= k <= 365).
//Определить, каким днем недели (понедельником, вторником, …, субботой или воскресеньем)
//является k-й день не високосного года, в котором 1 января понедельник.
namespace Tyuiu.TatarinovDA.Sprint2.Task5.V15
{
    class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #2 | Выполнил: Татаринов Д. А. | ИСТНб-26-1";
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* Спринт #2                                                               *");
            Console.WriteLine("* Тема: Добавление к решению итоговых проектов по спринту                 *");
            Console.WriteLine("* Задание #5                                                              *");
            Console.WriteLine("* Вариант #15                                                             *");
            Console.WriteLine("* Выполнил: Татаринов Данил Андреевич | ИСТНб-26-1                        *");
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                *");
            Console.WriteLine("* Написать программу, которая использует оператор switch вычисляет        *");
            Console.WriteLine("* требуемое значение и возвращает результат.                              *");
            


            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
            Console.WriteLine("***************************************************************************");

            Console.WriteLine("* Введите число k : ");
            int k = Convert.ToInt32(Console.ReadLine());


            string res = ds.FindDayName(k);
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
            Console.WriteLine("***************************************************************************");


            Console.WriteLine($"{k}-й день года - это: {res}");


            Console.WriteLine("***************************************************************************");

            Console.ReadKey();
        }
    }

}