using Tyuiu.TatarinovDA.Sprint2.Task1.V2.Lib;
//Написать программу из операций сравнений (==, !=, <, >, <=, >=, последовательность можно чередовать,
//но использовать один раз в выражении) и логических операций (|, &, ||, &&, !, ^,
//последовательность операций не должна нарушаться), а также арифметических выражений,
//которая вернет логическую последовательность(массив): (True, True, True, True, True, False),
//при a = 135, b = 156, c = 154, d = 174
namespace Tyuiu.TatarinovDA.Sprint2.Task1.V2
{
    class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #2 | Выполнил: Татаринов Д. А. | ИСТНб-26-1";
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* Спринт #2                                                               *");
            Console.WriteLine("* Тема: Добавление к решению итоговых проектов по спринту                 *");
            Console.WriteLine("* Задание #1                                                              *");
            Console.WriteLine("* Вариант #2                                                              *");
            Console.WriteLine("* Выполнил: Татаринов Данил Андреевич | ИСТНб-26-1                        *");
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                *");
            Console.WriteLine("* Написать программу из операций сравнений  (==, !=, <, >, <=, >=,        *");
            Console.WriteLine("* последовательность можно чередовать,                                    *");
            Console.WriteLine("* но использовать один раз в выражении) и логических операций             *");
            Console.WriteLine("* (|, &, ||, &&, !, ^, последовательность операций не должна нарушаться)  *");
            Console.WriteLine("* а также арифметических выражений, которая вернет логическую             *");
            Console.WriteLine("* последовательность(массив): (True, True, True, True, True, False),      *");
            Console.WriteLine("* при a = 135, b = 156, c = 154, d = 174                                  *");

            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
            Console.WriteLine("***************************************************************************");
            int a = 135;
            int b = 156;
            int c = 154;
            int d = 174;
            Console.WriteLine($"* A = {a}, B = {b}, C = {c}, D = {d}                                     *");
            bool[] res = ds.GetLogicOperations(a, b, c, d);
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
            Console.WriteLine("***************************************************************************");

            foreach (bool item in res)
            {
                Console.WriteLine(item + " ");
            }
            Console.WriteLine("***************************************************************************");

            Console.ReadKey();
        }
    }

}
